tks-projects/libs/librs/test_rs/org/test_client.org
#+title: tks remotescript test document
#+author: bsp

* test 1
   Connects to script host "test_host" and evaluates some code.
   The host "MyAPI" provides a few members and methods to play with.
   #+begin_src tks-rs :host "test_host" :results output replace
     trace "hello, world.";
     trace "i="+MyAPI.i+" f="+MyAPI.f+" s=\""+MyAPI.s+"\"";
     trace "MyAPI.Add(23, 42)="+MyAPI.Add(23, 42);
     trace "MyAPI.Add(1.23, 4.56)="+MyAPI.Add(1.23, 4.56);
   #+end_src
   #+results:
   : hello, world.
   : i=42 f=3.14159 s="mystring"
   : MyAPI.Add(23, 42)=65
   : MyAPI.Add(1.23, 4.56)=5.79
