tks-projects/libs/librs/test_rs/org/test_client.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.57 in css mode. -->
<html>
  <head>
    <title>test_client.org</title>
  </head>
  <body>
    <pre>
<span class="org-document-info-keyword">#+title:</span> <span class="org-document-title">tks remotescript test document
</span><span class="org-document-info-keyword">#+author:</span> <span class="org-document-info">bsp
</span>
<span class="org-level-1">* test 1</span>
   Connects to script host "test_host" and evaluates some code.
   The host "MyAPI" provides a few members and methods to play with.
<span class="org-block-begin-line">   #+begin_src tks-rs :host "test_host" :results output replace
</span><span class="org-block">     trace </span><span class="org-block"><span class="string">"hello, world."</span></span><span class="org-block">;
     trace </span><span class="org-block"><span class="string">"i="</span></span><span class="org-block">+MyAPI.i+</span><span class="org-block"><span class="string">" f="</span></span><span class="org-block">+MyAPI.f+</span><span class="org-block"><span class="string">" s=\""</span></span><span class="org-block">+MyAPI.s+</span><span class="org-block"><span class="string">"\""</span></span><span class="org-block">;
     trace </span><span class="org-block"><span class="string">"MyAPI.Add(23, 42)="</span></span><span class="org-block">+</span><span class="org-block"><span class="constant">MyAPI</span></span><span class="org-block">.Add(23, 42);
     trace </span><span class="org-block"><span class="string">"MyAPI.Add(1.23, 4.56)="</span></span><span class="org-block">+</span><span class="org-block"><span class="constant">MyAPI</span></span><span class="org-block">.Add(1.23, 4.56);
</span><span class="org-block-end-line">   #+end_src
</span><span class="org-meta-line">   #+results:</span>
   <span class="org-code">: hello, world.
</span>   <span class="org-code">: i=42 f=3.14159 s="mystring"
</span>   <span class="org-code">: MyAPI.Add(23, 42)=65
</span>   <span class="org-code">: MyAPI.Add(1.23, 4.56)=5.79
</span></pre>
  </body>
</html>
